# 자료형과 문자열
# str : string(문자열), int : integer(정수)
# type()함수로 알아볼 수 있음.
type('안녕하세요')

# 문자열 만드는법
print("안녕하세요") # 큰따옴표 사용
print('안녕하세요') # 작은따옴표 사용

# --> 오류 발생 가능
print(""안녕하세요"라고 말했다.")

#Sol 1. 큰/작은따옴표 둘다사용
print("'안녕하세요'라고 말했다.")

#Sol 2. 이스케이프 문자(\) 사용
print("\"안녕하세요\"라고 말했다.")

#다양한 이스케이프 문자
print("안녕하세요\n안녕하세요") # 줄바꿈
print("안녕하세요\t안녕하세요") # 탭

print(""" 안녕하세요
저는 한국에서 온
박대현이라고 합니다.""") # 여러 줄 문자열 기능

#의도치 않은 줄바꿈을 바꾸기 위해 \을 쓰기도 함
print(""" # 이 줄에 공백+줄바꿈이 생김.
안녕하세요
저는 한국에서 온
박대현이라고 합니다.
""")


print("""\
안녕하세요
저는 한국에서 온
박대현이라고 합니다.\
""")

# 문자열 연산자
print("안녕" + "하세요") # 문자열 연결 연산자
print("안녕하세요"*3) # 문자열 반복 연산자
print("안녕하세요"[2]) # 문자열 선택 연산자(0부터 시작!)

# 인덱스별로 [:]을 통해 슬라이싱도 됨.
# 인덱스 없는 걸 선택하면 인덱스오류 발생.

#숫자 연산자의 우선순위
# 곱셉 / 나눗셈이 우선.
print(2+2-2*2/2*2)

#문자열과 숫자처럼 서로다른 유형을 연산하면 Type Error 발생.


# 변수
a = 10 # 다양한 자료형을 대입하고 써먹을 수 있음.

# 복합 대입 연산자
a += 2
a -= 4
a *= 2
a /= 10
a %= 7
# 연산한 결과를 바로 대입함.

# 입력받기
input("입력하세요.")

# 숫자를 입력해도 무조건 문자열로 인식함.
number = input("숫자를 입력하세요.")
print(type(number))

#format()함수
#문자열이 가진 함수. 중괄호 자리에 format()안 값을 채워줌.
k = "{}".format(10)
type(k)

# 여러가지 형태 지정
"{:d}".format(52) # 정수출력
"{:5d}".format(52) # 출력 앞 공백
"{:05d}".format(52) # 출력 앞 0으로 채우기
"{:+d}".format(52) # 부호 표시
"{:+d}".format(-52)
"{:+5d}".format(52) # 기호를 뒤로 밀기
"{:+5d}".format(-52)
"{:=+5d}".format(52) # 기호를 앞으로 밀기
"{:=+5d}".format(-52)

#부동소수점 형태
"{:f}".format(52.273) #부동소수점만 받기
"{:15f}".format(52.273) # 출력 공간 확보
"{:+15f}".format(52.273) # 부호 표시
"{:+015f}".format(52.273) # 부호 표시 + 0채우기

#소수점 자리 지정
"{:15.3f}".format(52.273) # 소수점 3자리까지
"{:15.2f}".format(52.273) # 소수점 2자리까지

#의미없는 소수점 제거하기
"{:g}".format(52.0)

#f-문자열을 사용하기도 함.
f"3 + 4 = {3+4}"

# f-문자열과 format함수중에 뭐를 사용할까?
# --> 텍스트가 너무 길거나, 넣어야 하는 데이터가 리스트일 경우 format함수가 유리함.
